package chapter06;

/**
 * <h2>丑数问题</h2>
 * <h3>1. 丑数</h3>
 * <h3>2. 丑数 II</h3>
 * <h3>3. 超级丑数</h3>
 * <h3>4. 查找和最小的 K 对数字</h3>
 * <h2>多路归并</h2>
 * <h3>1. 首先将有序对 / 数存入堆结构中, 让其自然对其排序</h3>
 * <h3>2. 然后取出根结点, 也就是最小的那个有序对, 然后放入结果集中</h3>
 * <h3>3. 这个最小的有序对就会 “前进”</h3>
 * <h2>注意事项</h2>
 * <h3>注: 第一个题只是给前两个题做铺垫而已, 和后面两个题不是同一类型</h3>
 * <h3>注: 后两个题的思路完全一致, 最优的解法不太像动态规划, 而是一种叫做多路归并或者叫三指针的做法</h3>
 * <h3>注: 第四个题是进阶版, 思路类似但是代码不同</h3>
 */
public class UglyNumber
{
    public static void main(String[] args)
    {

    }
}
